hellenavilarosa/breakout_stm32_game/Src/main.c
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f1xx_hal.h"
#include "cmsis_os.h"

/* USER CODE BEGIN Includes */
#include "atraso.h"
#include "defPrincipais.h"
#include "NOKIA5110_fb.h"
#include "figuras.h"
#include "PRNG_LFSR.h"
/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;
DMA_HandleTypeDef hdma_adc1;

//osThreadId defaultTaskHandle;

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/
uint32_t ADC_buffer[2];
uint32_t valor_ADC[2];
xTaskHandle Quadradinhos;
xTaskHandle Bola;
#define lim_sup_X 80					// Limite superior no eixo X
#define lim_sup_Y 25					// Limite superior no eixo Y
#define lim_inf_X 0						// Limite inferior no eixo X
#define lim_inf_Y 15						// Limite inferior no eixo Y
#define velocidade 400					// Velocidade da plataforma

uint32_t perdeu=0;					// Flag usada para indicar se jogador perdeu
static uint32_t posicao_base_x[2] = {};	// Vetor posição no eixo X da barra
static uint32_t posicao_bola_x[100] = {};	// Vetor posição no eixo X da barra
static uint32_t posicao_bola_y[100] = {};	// Vetor posição no eixo Y da barra
struct pontos_t posicao_quadrados[25];
static uint32_t posicao_quadrados_y[25] = {}; // x1
static uint32_t posicao_quadrados_x[25] = {};//y2
static uint32_t posicao_quadrados_ativo[25] = {};//ativo
static uint32_t detectou_colisao=0;

static uint32_t n_quadrados_linha=4,tam_quadrado=15,n_linhas=2,alt_quadrado=10;// contando que 5 pixels sao de espaco
uint32_t semente=1;

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_ADC1_Init(void);
//void StartDefaultTask(void const * argument);

/* DEFINICOES PARA FACILITAR */
#define apagaBola desenha_circulo(x,y,2,0)
#define desenhaBola desenha_circulo(x,y,2,1)

void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef *hadc)
{
	if(hadc->Instance == ADC1)
	{
		valor_ADC[0]=ADC_buffer[0];
		valor_ADC[1]=ADC_buffer[1];
	}
}

//---------------------------------------------------------------------------------------------------
// Tarefa para atualizar periodicamente o LCD
void vTask_LCD_Print(void *pvParameters)
{
	while(1) imprime_LCD();
}
//---------------------------------------------------------------------------------------------------

void vTask_Quadradinhos (void *pvParameters){
	uint32_t k=0,t=0,aux=0;// contando que 5 pixels sao de espaco
	struct pontos_t quadrado;
	quadrado.ativo = 1;

	quadrado.x1 = 5;
	quadrado.x2 = 15;
	quadrado.y1 = 5;
	quadrado.y2 = 10;
	posicao_quadrados_x[aux]=quadrado.x1;
	posicao_quadrados_y[aux]=quadrado.y2;
	posicao_quadrados[aux] = quadrado;
	posicao_quadrados_ativo[aux] =quadrado.ativo;

	for(t=0;t<n_linhas;t++){
		desenha_retangulo(&quadrado,3);
		for(k=0;k<n_quadrados_linha;k++){
			quadrado.x1 = (quadrado.x1 + tam_quadrado);
			quadrado.x2 = (quadrado.x2 + tam_quadrado);
			quadrado.y1 = quadrado.y1;
			quadrado.y2 = quadrado.y2;
			aux++;
			desenha_retangulo(&quadrado,3);
			posicao_quadrados[aux] = quadrado;
			posicao_quadrados_ativo[aux] = quadrado.ativo;
			posicao_quadrados_x[aux]=quadrado.x1;
			posicao_quadrados_y[aux]=quadrado.y2;
		}
		quadrado.x1 = 5;
		quadrado.x2 = 15;
		quadrado.y1 = (quadrado.y1+alt_quadrado);
		quadrado.y2 = (quadrado.y2+alt_quadrado);
		aux++;
		posicao_quadrados_x[aux]=quadrado.x1;
		posicao_quadrados_y[aux]=quadrado.y2;
		posicao_quadrados[aux] = quadrado;
		posicao_quadrados_ativo[aux] = quadrado.ativo;
	}


	while (1){

	}

}

int detecta_colisao_quadrados(){
	uint32_t i=0, detecta=0;

	for(i=0;i<10;i++){ //10 quadrados iniciais
			if( (posicao_bola_y[0]-2==posicao_quadrados_y[i]) && (posicao_bola_x[0]>=posicao_quadrados_x[i]) && (posicao_bola_x[0]<=(posicao_quadrados_x[i]+tam_quadrado)) && (posicao_quadrados_ativo[i] == 1) ){
				detecta=1;
				desenha_retangulo(&posicao_quadrados[i],2);
				posicao_quadrados_ativo[i] = 0;
				detectou_colisao=1;
				return 1;
			}
	}

	if(detecta==0)
		return 0;
}

int checa_bateu_barra(){
	if((posicao_bola_y[0]+2 == 45) && (posicao_bola_x[0]>=posicao_base_x[0] && posicao_bola_x[0]<=posicao_base_x[1]) ){ // quando bater na barra flag =0 sai do while
		return 1;
	}
	else{
		return 0;
	}
}

void movimentaBola (int * x, int * y, char direcao, char altura){
	desenha_circulo(*x,*y,2,0);// apagando o anterior
	if(direcao == 'E'){
		*x -= 1;//diagonal esquerda
	}
	else if(direcao == 'D'){
		*x +=1;//diagonal direita
	}
	if(altura == 'S'){
		*y -= 1;
	}
	else if(altura == 'D'){
		*y += 1;
	}
	desenha_circulo(*x,*y,2,1);//desenha a nova bola
	posicao_bola_y[0]=*y;//atualiza posicao bola
	posicao_bola_x[0]=*x;
	HAL_Delay(100);
}


int perdeu_jogo(){
	if(posicao_bola_y[0]+2>45){
		goto_XY(0,0);
		string_LCD(" *******************************************************sorry, but you LOST :( ");
		HAL_Delay(1000);
		return 1;
		}
	else
		return 0;
}



int checa_borda_dir(int x, int y){
	if(x+2 >= 84){//limites do display direito
/*
		goto_XY(0,0);
		string_LCD("dir");
		do{
			movimentaBola(&x,&y,'E','D');
		}while((!checa_bateu_barra()) && (!perdeu_jogo()) && (!checa_borda_esq(x,y)) && (!checa_borda_cim(x,y)));
*/
		return 1;
	}
	return 0;

}
int checa_borda_esq(int x, int y){

	if(x-2 <= 0){//limites do display esquerdo
		/*goto_XY(0,0);
		string_LCD("esq");
		do{
			movimentaBola(&x,&y,'D','D');
		}while((!checa_bateu_barra()) && (!perdeu_jogo()) && (!checa_borda_cim(x,y)) && (!checa_borda_dir(x,y)));*/
		return 1;
	}
	return 0;
}

int checa_borda_cim(int x, int y){
	if(y-2 <= 0){//limite do display superior
/*
		goto_XY(0,0);
		string_LCD("cim");
		do{
			movimentaBola(&x,&y,'D','D');
		}while((!checa_bateu_barra()) && (!perdeu_jogo()) && (!checa_borda_esq(x,y)) && (!checa_borda_dir(x,y)));
*/
		return 1;
	}

