hellenavilarosa/breakout_stm32_game/Src/main.c
	return 0;
}

int checa_limites_tela(int x, int y){
	if((checa_borda_esq(x,y)==1 || checa_borda_dir(x,y)==1 || checa_borda_cim(x,y)==1 ))
		return 1;
	else
		return 0;
}


void vTask_Bola (void *pvParameters){
	uint32_t x;
	uint32_t y=25;
	uint32_t flag_pos_y=0;
	uint32_t flag_=0,flag_pos_x[3],flag_b=0;
	uint32_t perdeu_=0,aleatorio=0,trocouSentido=0;

	srand(semente); // numeros aleatorios
	x=rand()%82;

	posicao_bola_x[0]=x;
	posicao_bola_y[0]=y;
	flag_pos_x[0]=x;
	desenhaBola;

// INICIO
	while(perdeu_== 0){
			apagaBola;// apagando o anterior
			y++;
			desenhaBola;//desenha novo circulo
			posicao_bola_x[0]=x;
			posicao_bola_y[0]=y;
			HAL_Delay(100);
		//checando se a bola esta batendo na barra
		if((posicao_bola_y[0]+2==45) && (posicao_bola_x[0]>=posicao_base_x[0] && posicao_bola_x[0]<=posicao_base_x[1]) ){
				perdeu_=1;
		}
		else{
			perdeu_jogo();
		}
	}
	perdeu_=0;


	while (1){
		trocouSentido = 0;
		while(!perdeu_jogo()){
//QUANDO BATE NA PARTE ESQUERDA DA BARRA (vindo sempre de cima)
			if((posicao_base_x[0] <= posicao_bola_x[0] && posicao_bola_x[0] <= (posicao_base_x[0]+10)) ){
				// se a bola estiver vindo da direita
				posicao_bola_x[0]=x;
				posicao_bola_y[0]=y;
				if(flag_pos_x[0]>40){
					aleatorio=rand()%4;
					apagaBola;
					x -= aleatorio;
					while((!detecta_colisao_quadrados()) && trocouSentido == 0){ ///enquanto nao bater na barra de cima
						if (checa_limites_tela(x,y)){
							trocouSentido = 1;
						}
		/*
						if(posicao_bola_x[0]+2 >= 84){//limites do display
							trocouSentido = 1;
							do{
								movimentaBola(&x,&y,'E','D');
							}while((!checa_bateu_barra()) && (!perdeu_jogo()));
						}
		*/				else{
							movimentaBola(&x,&y,'E','S');
						}
					}
				}
				//se a bola estiver vindo da esquerda
				else if(flag_pos_x[0]<=40){
					aleatorio=rand()%4;
					apagaBola;
					x += aleatorio;
					while((!detecta_colisao_quadrados()) && trocouSentido == 0){ //enquanto nao bater no quadrado de cima
						if (checa_borda_esq(x,y)==1 || checa_borda_dir(x,y)==1 || checa_borda_cim(x,y)==1 ){
							trocouSentido = 1;
						}

					/*	if(posicao_bola_x[0]-2 <= 1){
							trocouSentido = 1;
							do{
								movimentaBola(&x,&y,'E','D');
							}while((!checa_bateu_barra()) && (!perdeu_jogo()));
						}*/
						else{
							movimentaBola(&x,&y,'D','S'); //movimenta bola para direita
						}
					}
				}

			//BOLA BATENDO NOS QUADRADINOS DE CIMA
				if(detectou_colisao==1){ // caso bata nos quadrados ativa a flag
					flag_b=1;
					posicao_bola_x[0]=x;
					posicao_bola_y[0]=y;
					flag_pos_x[0]=x;

					while(flag_b==1){// caso bateu nos quadrados ele vai voltar na diagonal até que a flag volte para 0
						if(flag_pos_x[0]>40){ // vindo da direita
							movimentaBola(&x,&y,'E','D');
						}
						if(flag_pos_x[0]<=40){//vindo da esquerda
							movimentaBola(&x,&y,'D','D');
						}
						//checa se bateu na barra
						if(checa_bateu_barra()){ // quando bater na barra flag =0 sai do while
							flag_b=0;
							detectou_colisao=0;
						}
						//se nao tocou na barra-> perdeu
						if(perdeu_jogo()){
							flag_b=0;
							detectou_colisao=0;
						}
						if(checa_limites_tela(x,y)){
							flag_b = 0;
							trocouSentido = 1;
						}

					}
					flag_pos_x[0]=x;
					posicao_bola_x[0]=x;
					posicao_bola_y[0]=y;
				}
			}
//PARTE DIREITA DA BARRA
			else if((posicao_base_x[1] >= posicao_bola_x[0] && posicao_bola_x[0] > (posicao_base_x[1]-10))){
				// se a bola estiver vindo da direita
				posicao_bola_x[0]=x;
				posicao_bola_y[0]=y;
				if(flag_pos_x[0]>40){
					aleatorio=rand()%4;
					apagaBola;
					x += aleatorio;
					while((!detecta_colisao_quadrados()) && trocouSentido == 0){ ///enquanto nao bater na barra de cima
						if (checa_borda_esq(x,y)==1 || checa_borda_dir(x,y)==1 || checa_borda_cim(x,y)==1 ){
							trocouSentido = 1;
						}
						/*if(posicao_bola_x[0]+2 >= 84){
							trocouSentido = 1;
							do{
								movimentaBola(&x,&y,'E','D'); //movimenta bola para esquerda
							  }while((!checa_bateu_barra()) && (!perdeu_jogo()));
						}*/
						else{
							movimentaBola(&x,&y,'D','S');
						}
					}
				}
				//se a bola estiver vindo da esquerda
				else if(flag_pos_x[0]<=40){
					aleatorio=rand()%4;
					apagaBola;
					x -= aleatorio;
					while((!detecta_colisao_quadrados()) && (trocouSentido == 0)){ //enquanto nao bater no quadrado de cima
						if (checa_limites_tela(x,y)){
							trocouSentido = 1;
						}

/*						if(posicao_bola_x[0]-2 <= 1){
							trocouSentido = 1;
							do{
								movimentaBola(&x,&y,'E','D'); //movimenta bola para esquerda
							}while((!checa_bateu_barra()) && (!perdeu_jogo()));
						}*/
						else{
							movimentaBola(&x,&y,'E','S');
						}
					}
				}
				flag_pos_x[0]=x;
				posicao_bola_x[0]=x;
				posicao_bola_y[0]=y;

				//BOLA BATENDO NOS QUADRADINOS DE CIMA
				if(detectou_colisao==1 ){ // caso bata nos quadrados ativa a flag
					flag_=1;
					posicao_bola_x[0]=x;
					posicao_bola_y[0]=y;
					while(flag_==1){// caso bateu nos quadrados ele vai voltar na diagonal até que a flag volte para 0
						if(flag_pos_x[0]>40){ // vindo da direita
							movimentaBola(&x,&y,'D','D');
						}
						else if(flag_pos_x[0]<=40){//vindo da esquerda
							movimentaBola(&x,&y,'E','D');
						}
						//checa se bateu na barra
						else if(checa_bateu_barra()){ // quando bater na barra flag =0 sai do while
							flag_=0;
							detectou_colisao=0;

						}
						//se nao tocou na barra-> perdeu
						else if(perdeu_jogo()){
							flag_=0;
							detectou_colisao=0;
						}
						if(checa_limites_tela(x,y)){
							flag_ = 0;
							trocouSentido = 1;
						}
					}
					flag_pos_x[0]=x;
					posicao_bola_x[0]=x;
					posicao_bola_y[0]=y;
				}
			}
			if(trocouSentido == 1){
				flag_= 1;
				flag_pos_x[0]=x;
				flag_pos_y=y;
				trocouSentido = 0;
				while(flag_==1){// caso bateu nos quadrados ele vai voltar na diagonal até que a flag volte para 0
					//checa se bateu na barra
					if(checa_bateu_barra()){ // quando bater na barra flag =0 sai do while
						flag_=0;
						detectou_colisao=0;
					}
					//se nao tocou na barra-> perdeu
					else if(perdeu_jogo()){
						flag_=0;
						detectou_colisao=0;
					}
					else if (checa_borda_cim(flag_pos_x[0],flag_pos_y)){
						goto_XY(0,0);
						string_LCD("cim");
						movimentaBola(&x,&y,'D','D');
					}
					else if (checa_borda_dir(flag_pos_x[0],flag_pos_y)){
						goto_XY(0,0);
						string_LCD("dir");
						movimentaBola(&x,&y,'E','D');
					}
					else if (checa_borda_esq(flag_pos_x[0],flag_pos_y)){
						goto_XY(0,0);
						string_LCD("esq");
						movimentaBola(&x,&y,'D','D');
					}
					if(checa_limites_tela(x,y)){
						flag_ = 0;
						trocouSentido = 1;
					}
				}
			}
		}
	}
}


void vTask_Base (void *pvParameters){
	struct pontos_t t;
	t.x2 =50; //sup_x  largura da linha (fica maior quando aumenta o numero)
	t.y2 =45; //sup_y //altura (fica maior quando diminui o numero)
	t.x1 = 30; //inf_x // comprimento (linha maior quando diminui o numero
	t.y1 = 50; //inf_y //
	desenha_retangulo(&t,3);

	while (1){
		posicao_base_x[0]=t.x1;
		posicao_base_x[1]=t.x2;

		if(valor_ADC[1]>2500){//direita
			if(posicao_base_x[1]>=84){//delimitando a barra da tela
				desenha_retangulo(&t,2);
				t.x2=84;
				t.x1=64;

